SRC/Openfoam_translator/test_model_fluid_simulation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 ) ;

boundaryField
{
    top_fluid_surface
    {
        type            fixedValue;
        value           uniform ( 1 0 0 ) ;

    }


    bottom_fluid_surface
    {
        type            noSlip;

    }

    lateral_surface_4
    {
        type            noSlip;

    }

    lateral_surface_3
    {
        type            noSlip;

    }

    lateral_surface_2
    {
        type            noSlip;

    }

    lateral_surface_1
    {
        type            noSlip;

    }
}